jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/service/impl/SdStorageServiceImpl.cpp
void SdStorageServiceImpl::enableStressTest(uint16_t hz) {
    mStressTestHz = hz;
}

void SdStorageServiceImpl::enableAdcStressTest(uint16_t sps, uint16_t batchSize) {
    mAdcStressTestSps = sps;
    if (batchSize > 0 && batchSize <= MAX_BATCH_SAMPLES) {
        mAdcBatchTarget = batchSize;
    }
    printf("[SdStorage] ADC stress test: %u SPS, batch=%u\n", sps, mAdcBatchTarget);
}

void SdStorageServiceImpl::appendDummyRecord() {
    if (!mDbReady) return;

    SensorDataModel dummy;
    dummy.temperature = 25.0f + (float)(mNonceCounter % 100) * 0.01f;
    dummy.accelX = (int16_t)(mNonceCounter & 0x7FFF);
    dummy.accelY = 0;
    dummy.accelZ = 0;
    dummy.updateTimestamp();
    appendRecord(&dummy);
}

void SdStorageServiceImpl::appendDummyAdcBatch() {
    if (!mDbReady) { printf("[SD] dummyAdc: not ready\n"); return; }
    printf("[SD] dummyAdc: target=%u\n", mAdcBatchTarget);

    // Generate dummy 8-channel ADC samples
    // Each sample: 8 channels × 3 bytes = 24 bytes
    for (uint16_t i = 0; i < mAdcBatchTarget && mAdcBatchCount < MAX_BATCH_SAMPLES; i++) {
        uint16_t offset = mAdcBatchCount * AdcDataModel::SAMPLE_SIZE;
        
        // Generate 8 channels of 24-bit data (3 bytes each)
        for (uint8_t ch = 0; ch < 8; ch++) {
            // Dummy pattern: channel index + sample counter
            uint32_t value = ((mNonceCounter + mAdcBatchCount) * 8 + ch) & 0xFFFFFF;
            mAdcBatchBuffer[offset + ch * 3 + 0] = (value >> 0) & 0xFF;
            mAdcBatchBuffer[offset + ch * 3 + 1] = (value >> 8) & 0xFF;
            mAdcBatchBuffer[offset + ch * 3 + 2] = (value >> 16) & 0xFF;
        }
        
        mAdcBatchCount++;
        mSamplesInWindow++;
    }
    
    // Flush batch immediately
    flushAdcBatch();
}

} // namespace sdstorage
} // namespace arcana
